  EDUCATION 
Oct 09 – Jun 13: Imperial College London - MEng Computing 
Overall degree total: 72.8% (First Class Honors)
Core subjects: Programming, Operating Systems, Advanced Databases, Software Engineering-Design, Algorithms, Networks, Design Led-Innovation-Venture Creation, Entrepreneurship, Distributed Systems

Meng Final Year Project – AutoPig - Overall Grade: 79%
Investigate techniques and develop tools for automatic generation of Apache Pig scripts, using IQL, a list comprehension based language and Python to perform data integration of a number of Big Data sources. The languages used for the tool were Java for the data integration, Python for the compiler, IQL as a source language and Pig Latin as the target language of the scripts.
Beng Final Year Group Project – SpeakerRec - Overall Grade: 82%
Implement a voice recognition and identification platform in Java, using Vector Quantization and Euclidean distance methodologies to identify users through their voice samples stored in the database with 99% accuracy across the entire university sample. 
The platform was shortlisted for project of the year award.
Sep 04 –Jun 07: Agios Nicolaos Lyceum Cyprus - (School Leaving Certificate) – Overall grade: 19.44/20
Core Subjects: Mathematics (19), Physics (18), Computer Science (19), Office Skills (20).
Achievements
- Coordinated the first prize-winning team on the 1st National Technology Competition of University of Cyprus for the Robotics Team Competition 2006. The same team reached the semifinal stage the following year's competition.
Part of the Cyprus representative team in the European Parliament in Brussels meeting of 2007.


{
  "education" => {
    "school" => "Imperial College London",
    "degree" => "MEng Computing" 
    "start_time" => "Oct-09",
    "end_time" => "Jun 13",
    "grade" => "72.8% (First Class Honors)",
    "core subjects" => [
      "Programming",
      "Operating Systems",
      "Advanced Databases",
      "Software Engineering-Design",
      "Algorithms",
      "Networks",
      "Design Led-Innovation-Venture Creation",
      "Entrepreneurship",
      "Distributed Systems"
    ]
  }

}
